U> Hello, Dominik. 
S> Hello, Francesca. Good evening.
U> Good evening. Shall we cook something? 
S> Yes, sounds really good. What would..what would you like to eat? 
U> Well, I have ähh some meat in the freezer. I have some Ribs.
S> Some ribs?
U> Do you..can you suggest me a good recipe for ribs, please? 
S> Hmm..let me think, I think there might.. I have something Norwegian. 
U> Oh
S> For ribs. Would you like to try that? 
U> Yes, yes. Sure. I would be interested. 
S> It is pork, right? 
U> I have it, yes, pork ribs. 
S> Perfect, perfect. I think we can try that maybe. It'll take some time, around 2 hours. Is it fine? 
U> It is. It is fine. It is for a later dinner. 
S> Additionally, also 30 minutes preparation. 
U> It is OK
S> OK, ok. Perfect, perfect. Then we can try that. So, we would need the pork ribs. 
U> Hmm
S> Ähh, we need garlic. 
U> I have allergic to garlic.
S> Ohh 
U> What could what should I use instead? 
S> I think you can just leave it out in this case. 
S> Yeah, I think there's nothing that would fit. But I think there's nothing. 
U> OK. What else then? 
S> Sea salt, flakes. 
U> Yes
S> Hmm. You have flakes?. 
U> Yes, I do. Yeah. I happen to have. 
S> OK, perfect, perfect. And also ähh juniper berries. 
U> Hmm. I have.
S> Hmm..ok. A spoon ähh a teaspoon around. 
U> Hmm
S> And a large bunch of ähh fresh dill. 
U> I have. Who doesn't? 
S> OK. And fronds and stalks separated 
U> I have.
S> Ok, perfect, perfect. Ähh.. around 40, 40 grams. 
U> I went to the forest just yesterday. To grab my dill. 
S> That's great. That's perfectly prepared. Additionally you need also two onions. 
U> Yes.
S> And they ähh need to be peeled and also cut later in...
U> I will do that now.
S> ...three thick slices, but 3 thick slices. Not chopped, but.
U> Done
S> OK. And in the end you also need like around ähhmm 250 milliliters hot water. Just boiled. 
U> OK. 
S> Do you want to start? Have everything? 
U> Yes, I am ready. 
S> OK then. And we start to take the pork out of the fridge. 
U> Yes
S> And let it rest for an hour. 
U> OK, what should they do in the mean times? 
S> In the meantime, you can chop you onions. If you have not done it already. 
U> Yes, I have it.  
S> Yeah. And then you wait. 
U> Yes, I wait, waiting, waiting, waiting. And now? 
S> OK. Then.. Are you done waiting?
U> Yes. I have waited. Now? 
S> OK. Hmm then hmm put garlic..you dont have any garlic. 
U> No.
S> So you put hmm.. Add 2 tablespoons of salt. Take two tablespoons...
U> To what? 
S> And put them in the mortar. 
U> OK. 
S> And add the juniper berries 
U> Hmm
S> and the stalks of the dill. 
U> Ok.
S> The rest you need for later. 
U> Ok.
S> And then you just start ähmm bashing them, grinding, crushing, whizzing, whatever you need to do. 
U> Done it. All
S> And yeah, in the end you should have an aromatic green paste. 
U> It does. 
S> OK. 
U> It is totally green. 
S> OK, perfect. Perfect. So...
[pause]
U> What shall I do now? 
S> You have the meat 
U> Hmm
S> and the butcher has sawed through it two times and there are.. in these places you can put in the paste. 
U> Done.
S> And ähh and we also can take a knife to run through them a little bit to open it up 
U> Ok
S> and then press the cream paste into it evenly. 
U> I have done it.
S> Hmm 
U> What's next? 
S> Use the dill, the rest of the dill. You have the fronds
U> Hmm
S> And push them also in
U> Sorry? 
S> You push them also in
U> OK. 
S> OK. And now you can turn the pork, rindside up
U> OK. 
S> And rub the rind and sides of the pork with the remaining ähmm sea salt. One tablespoon. 
U> My salt is finished. 
S> Then use just more salt. 
U> OK. 
S> OK, and now you can get out ähh a large roasting tin.
U> Hmm 
S> Ähmm And you place the onion slices, the very rough onlion slices in the tin and yes.
U> It is done. 
S> And now you need to place the pork onto the onion. 
U> How should I do that?
S> Important thing here is that the one side is slightly higher than the other side. So the onions are some kind of some kind of ähmm
S> Some kinds of ähmm.. some kind of ähh.. How are they called? 
U> Zylinder? 
S> Huh?
U> Zylinder?
S> Yes, yes. But like yeah they help ähmm fixing like ähh they are like like the like like a table. 
U> OK. 
S> So yeah.. 
U> I really don't even have the slightest clue, what should, how i should do that. I will just do that randomly. Done.
S> Ok ähh so and the the reason for that is that the liquid can just pour down
U> OK. 
S> And it doesn't pool in that rind there, because that would make the meat a lttle bit soaky. 
U> Hmm
S> So, the pork, rindside up onto the onions, and then you leave them for an hour ähm until the ähm until the ähm coolness of the meat is gone. 
U> Hmm
S> And now you can start preheat the oven for 220 degrees. 
U> I have done it. What should we do? 
S> Ähm then use the 250 milliliters boiled water into this roasting tin and now...
U> That's a weird recipe. 
S> I know. Cover the tin with ähh with kitchen foil. 
U> I don't have a kitchen foil. What should I use instead? 
S> Then you can maybe use a lid
U> OK. 
S> And cook it for around 45 minutes in the hot oven. 
U> Hmm
S> And after that just wait 
U> I have done. 
S> Aha? Already? It was... 
U> Yes, I'm very quick. 
S> ...very quick 45 minutes. And now you take out the pork and remove they lid. 
U> Hmm
S> The meat shoud have softened up and ...
U> Damn it, I burned myself. 
S> You're stupid. Ähm..I don't care. 
U> Haha..about my burned meat. OK, what's next? 
S> You need a sharp knife, because now you need to define these squares on the rind. 
U> Ah..I've got cut.  
S> You're so stupid. 
S> Just maybe you should just stop with cooking. 
U> No, no, I want to do that. 
S> We could just order pizza. 
U> Haha..do something on your league: order pizza. 
S> Are you sure that you want to go on? 
U> I am, I am, I am. 
S> OK, then be a little bit more careful next time. 
U> I will. 
S> So you still..again a sharp knife. Careful, it is sharp!
U> Hmm
S> And now you can define the squares on the ähh rind. 
U> OK. 
S> Yeah, and cut a little deeper into the original scoring marks. Ähmm. Yes, around 2 centimeters squares. Now, 
U> Done. Hey, weren't you be waiting for me to say done? 
S> No, no, I'm not, because you're too slow. Ähh..I should, I should be waiting for you because you're very slow today. 
U> Yes, please. 
S> Turn down the oven to 170 degrees. 
U> Hmm..done.
S> Pork back into the oven. Without the foil, this time, ähh without the lid. I'm sorry. 
U> OK. 
S> And make sure there's still like one side is higher...
U> Yes 
S> ...than the other that ähh it can go down. And now roast it for two and a half hours. 
[pause]
U> Done
S> OK, you can try to feel the äh the meat. With a knife. Just with the tip of the knife and then feel it, if it's tender or not. Is it tender? 
U> It's bleeding. 
S> Then you can give it another 30 minutes in the oven. 
U> OK. 
S> Ok. Now, take it out.
U> Hmm 
S> And oven goes back up to 220 degrees. 
U> Hmm
S> And haha..meat goes in again. Around 15 minutes. 
U> OK, done. 
S> And important here is the rind. The rind should be very crusty, but not burned. 
U> Hmm, hmm.
S> So around 50 minutes. If takes longer, leave it longer. If it is already...
U> Should I take a look sometimes? 
S> Yes, all all the time. Just don't burn it. 
U> Ok. I will try. 
S> Also, it should be still crispy. 
U> OK. 
S> And gold crunchy. Ähh. Some of these, these sqaures should have just popped up. 
S> It's just...
U> It does. One popped up. 
S> Yeah, then just wait a little bit. And then...
U> Ok. They are all popped up
S> Yeah, then take the pork out and and remove it carefully, the pork from the from the pan to a cutting board. 
U> What should I use to do that? 
S> Think.
U> And aren't you here to help me? 
S> OK. Then you use big knives or or ähh two spoons.
U> OK. I have done it. 
S> OK. Hmm. So now, you cut through both sides of the rib. 
U> Hmm
S> And down to where the butcher cut through the bones again. 
U> Hmm
S> Then cut a chunky rip section for each person. 
U> That is done. 
S> And..perfect. So. Yes
U> It is all done. 
S> I think, I think you can enjoy it, your meal now. 
U> OK. Thank you very much.
S> Prego 
U> It was a pleasure cooking with you. 
S> OK.