U> Hello, good evening, Francesca. 
S> Hello, Dominik. 
U> Ähmm should we cook something today? 
S> Sure! What äh kind äh of the of ähh kitchen would you like? 
U> I think Italian kitchen would be quite nice. 
S> Nice, ähh should we prepare ähhh first course, second course? 
U> Aha. First course today. 
S> Sure. OK. Shall we go for something vegetarian or something with meat? 
U> Hmmmm...meat, vegetarian. I think vegetarian is äh..vegetarian today. 
S> Ok. And we have a lot of choices. We could do pasta, we could do polenta, we could do hmm Pizza.  
U> Do you have something with rice? Maybe a Risotto...
S> Yes, yes. Oh yes, I have a baked mushroom risotto. 
U> Baked? Hmm..never heard of that. But we can try. 
S> Nor I. Haha. Some fake Italian. OK, well, ähh it's just 10 to 30 minutes for cooking and the less than 30 minutes for preparation. 
U> Sounds good. What do we need? 
S> We need olive oil, two tablespoons. One onion, finely chopped. 
U> OK, chopped. aha. 
S> Three garlic cloves, finely sliced. 
U> Ah, yes. Sounds good. Sounds good. 
S> Then 400 grams of mixed mushrooms. 
U> Mixed mushrooms, OK, OK, Champions, do they work? 
S> Yes, here it suggests button and Portobello. 
U> Ahh 
S> But I think it's just, uh, accords to taste. 
U> OK, I only have champions, but, .... 
S> It should be fine and they should be roughly chopped. 
U> Roughly chopped. Ok. What else? 
S> Hmm..1-2, according to the taste, tablespoons of Rosemary, also finely chopped. 
U> Ah. Fresh?   
S> Yes, why not?  
U> Ok 
S> And 200 grams of Risotto rice. 
U> Aha 
S> Then ähh 100ml of white wine. 
U> Right, perfect. I have some leftover from yesterday evening. 
S> Perfect. What did you do? 
U> I drank some wine. Haha 
S> Haha..OK, I know I should mind my business. So, we also need äh 750 milliliters of a vegetable stock. 
U> Aha. Yes.. perfect 
S> And 30 gram of grated parmesan, but we need also a little extra for the topping, 
U> Ok 
S> so like 50 maybe or something like that. 
U> 50 grams parmesan. OK. I see, I see. 
S> and extra virgin olive oil for the drizzling. 
U> Yeah, sounds good. Sounds good. I have that. OK, so how do I start? 
S> Are you ready with..Have you already ähh chopped all of ähh... 
U> No, no, no, of course not. 
S> ...vegetables? Then you shall begin by chop everything. 
U> That means onions? 
S> Onions. 
U> finely chopped in dice. Fine dice. 
S> Yes. Ähh. Then finely sliced garlic. 
U> OK, wait, wait, wait. I'm chopping, chopping. OK, slicing the garlic, OK, sliced the garlic. 
S> Then roughly chop the mushrooms. 
U> Roughly, what does roughly mean? 
S> It means quite big and irregular. 
U> OK, OK. Yes, yes. Hmm. Yes, I ähh I think that's fine. 
S> Then now you should chop finely the Rosemary. 
U> OK. 3 branches or how many was it? 
S> It was just one to two Tablespoons... 
U> Tablespoon. 
S> ...of just the chopped. 
U> OK, OK, I see. Chopping. OK, done. 
S> OK, then we can...you can begin from preheating the oven to 180 degrees  
U> OK 180 degrees. Yeah, ok. Done. 
S> Then ähh you take an oven proof lidded dish. 
U> Hmm 
S> Heat the oil and fry the onions for three minutes. 
U> OK, throwing in the onions. 
S> Or until starting to soften. 
U> OK, what about the garlic? 
S> You should add later when the onion are softer. 
U> Ok 
S> You added the garlic and cook it for 5 minutes. 
U> OK, both is done. 
S> Add the mushrooms for three to four minutes or until soft. 
U> OK. Hmm..ok. Throwing mushrooms in. Shall I stir them around or just let them be? 
S> Yes..yes. Stir them around a bit, not too much, to not break them. 
U> Doing it, doing it. 
[pause] 
S> What are you doing? Are you going to collect the mushrooms youself? 
U> Haha..ok. I'm done. 
S> Perfect. Then you can stir in the Rosemary. 
U> The Rosemary? 
S> Yes 
U> Ok 
S> Add the Risotto rice and cook until the grains appear glassy. 
U> What does glassy mean? 
S> I really have no idea. No person with the...a sense of cooking would say glassy with the rice. 
U> OK then I will just try until it's it's fried or just... 
S> Hmm..I think transparent maybe. It's just stupid. 
U> Haha..ok. I will try that. Hmm. Hmm. And now? 
S> Stir in the wine and stock 
U> The wine? Shall I ähmm...use a different temperature or just the same? 
S> No, it's OK. 
U> Hmm..OK. It starts zisching. Ok..adding the stock now. And now? 
S> Now.. 
U> Stirring? Lid on? Or what? 
S> It is fine. now you just place the lid on the dish and bake for 15 minutes  
U> Ok 
S> but stirring half way through. 
U> OK. 
S> So you we might put ähh a 7 1/2 minutes timer, stir, and then another 7 1/2. 
U> Ok, ok. Perfect. Can you set the timer, please? 
S> Ok 
U> Thanks 
S> Now, stir in the parmesan and bake for three more minutes. 
U> Hmm 
S> Should I set the timer? 
U> Yeah..parmesan is in 
S> Done. Now sprinkle..sprinkle over some extra parmesan. 
U> Oh no, I forgot it again. I just put all of the parmesan into the dish. 
S> Then grape it quickly, peanut. 
U> Haha, I don't have any anymore. OK. Next time maybe. Well, can I use something else? 
S> should you...can you use another cheese maybe? 
U> I have some tasty cheddar. 
S> Perfect, it will ruin the whole dish, but already the Risotto is completely mushy. 
U> What would you recommend? Should add it, or... 
S> Hmm. You can ähh add it a bit and not too much please. 
U> Ok 
S> Please! 
U> Haha..ok. 
S> Now drizzled with extra virgin olive oil on top and finish with a little black pepper. 
U> Hmm. Black pepper? I like black pepper. 
S> Now serve and enjoy your meal. Bon appetit! 
U> Thank you very much. 